import 'package:bodar_parivar_web/app/utils/styles.dart';
import 'package:flutter/material.dart';
import 'package:gap/gap.dart';
import 'package:get/get.dart';

import '../controllers/mandir_controller.dart';

class MandirView extends GetView<MandirController> {
  const MandirView({Key? key}) : super(key: key);
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('મંદિર ઇતિહાસ'),
        backgroundColor: Theme.of(context).colorScheme.inversePrimary,
      ),
      body: ListView(
        padding: const EdgeInsets.symmetric(
          horizontal: 24,
          vertical: 16,
        ),
        children: [
          Text(
            'બોદર પરીવારના કુળદેવી આઈશ્રી ખોડીયાર તથા ઈસ્ટદેવશ્રી હનુમાનજી મહારાજના મંદિરના જીર્ણોધારના ઈતિહાસ ઉપર એક નજર.',
            style: Styles.bold(fontSize: 20),
            textAlign: TextAlign.center,
          ),
          Divider(
            indent: Get.width * .2,
            endIndent: Get.width * .2,
          ),
          const Gap(16),
          Text(
            'પ્રથમ હનુમાનદાદાનું મંદિર એક મકાનની ઉગમણી દિવાલને અડીને આવેલ હતું. મંદિરના આગળના ભાગે એક પીપળાનું ઝાડ હતું અને નાની એવી ડેરી તથા બેસવા માટે નાનો ઓટો હતો. ઓટો પૂરો થતાં થોડી જગ્યા અને પછી ઉગમણા ભાગે દીવાલ હતી. દિવાલ માંથી ગામમાં જવા માટેની બારી હતી. હાલ જ્યા લાઈટનો થાંભલો ઉભો છે તે બજારમાં છે. આ મંદિરનો પ્રથમ જીર્ણોધાર વાસાવડ વાળા સ્વ.રૂડાબાપાના હસ્તે થયેલ હતો. જેમાં દાદાના મંદિર આગળ તથા દક્ષિણબાજુમાં જગ્યા ઉપર સ્લેબ ભરી બનાવવામાં આવેલ હતું અને મંદિર ફરતે લોખંડની ગ્રીલ ફીટ કરવામાં આવેલ હતી. દાદાના મંદિરની પાછળ નાની ઓરડીમાં માતાજીના તથા સુરાપુરા દાદાના ફળા પધરાવવામાં આવેલ હતા. અગાઉ ખોડીયાર માતાજી મેરીયાણા બિરાજતા હતા. જ્યાં માતાજીનો મઢ હાલ પણ છે. પરંતુ માતાજીને મોણપુરમાં ક્યારે લાવ્યા તેનાં કોઈ ઉલ્લેખ મળતો નથી પરંતુ આ જીર્ણોધાર વખતે પ્રાણ પ્રતિષ્ઠાની પત્રિકામાં તેનાં ઉલ્લેખ છે. જેથી આ પ્રાણ પ્રતિષ્ઠા પહેલા મેરીયાણાથી લાવીને અથવા નવા ફળાનું પુજન કરી પ્રતિષ્ઠા કરવામાં આવેલ હશે. આ રીતે પ્રથમવાર જીર્ણોધાર થતાં સવંત ૨૦૩૪ના શ્રાવણ વદ ૧ ને શનિવાર તા.૧૯-૦૮-૭૮ ના રોજ ખોડીયાર માતાજી તથા હનુમાન દાદાની પ્રાણ પ્રતિષ્ઠા શ્રી રૂડાબાપાના પુત્ર શ્રી વ્રજલાલભાઈના હાથે કરવામાં આવેલ હતી.દાદાના મંદિરને અડીને ઊત્તર બાજુ બીજાની મિલકત આવેલ હોવાથી મંદિરની ફરતે પ્રદિક્ષણા થઈ શકતી ન હતી. ધણા વર્ષો આ રીતે પસાર થયા બાદ સવંત ૨૦૫૯ ચૈત્ર સુદ ૪ શનિવાર તા.૦૫-૦૪- ૨૦૦૩ ના રોજ માતાજીના મંદિર માટેની જગ્યા ખરીદવામાં આવી. દરમ્યાન શ્રી ભુપતભાઈ જસમતભાઈ બોદર ગામ બેડલા હાલ, રાજકોટ તરફથી માતાજીની આરસની મૂર્તી દાન રૂપે પ્રાપ્ત થઈ અને આ અરસામાં સુરતના બોદર પરીવારના મિત્રો તરફથી રાજસ્થાનથી હનુમાન દાદાની મૂર્તી તથા બ્રહ્માણી માતાની મૂર્તી લાવવામાં આવી. આ મૂર્તીના તમામ ખર્ચ સુરત વાળા બોદર પરિવાર તરફથી કરવામાં આવેલ હતો. આમ નૂતન મૂર્તીઓ આવતા તેની પ્રાણ પ્રતિષ્ઠા કરવી જરૂરી બનતા સવંત ૨૦૫૯ ના ચૈત્ર સુદ ૧૧ તા.૧૩-૦૪-૨૦૦૩ ના રોજ નૂતન મૂર્તીઓની પ્રાણ પ્રતિષ્ઠા કરવામાં આવી. આ પ્રતિષ્ઠાના હવનમાં મૂર્તી લાવનાર દાતા શ્રી ભૂપતભાઈ જસમતભાઈ બોદર મુ. બેડલા હાલ, રાજકોટ તથા હવનના તમામ પૂજાપાના દાતા શ્રી બાબુભાઈ નનુભાઈ બોદર મુ. મોટા આંકડીયા વાળા હાલ, સુરત તથા ત્રણ દિવસના હવન માટે ભોજન તથા મોણપુર ગામ ધુવાડા બંધ જમાડવા માટે સમગ્ર મહાપ્રસાદના દાતા શ્રી હંસરાજભાઈ કુરજીભાઈ બોદર ગામ. કેરીયાનાગસ હાલ અમરેલીવાળા તરફથી પ્રાપ્ત થયો હતો. ત્યારે આ મૂર્તીની પ્રતિષ્ઠા હાલ જ્યા દાદાનું મંદિર છે તેના દક્ષિણ ભાગે ઓસરીમાં સિહાસન બનાવીને તેના પર પધરાવી માતાજીની મૂર્તીની પ્રતિષ્ઠા કરવામાં આવેલ હતી. આ સમયે લોક ડાયરાનું તથા ભજન સંધ્યાનું આયોજન શ્રી ભૂપતભાઈ બોદર તરફથી કરવામાં આવેલ હતું. સમય જતાં પરિવાનો ઘણો મોટો સમુદાય હનુમાન જયંતિની ઉજવણીમાં ભાગ લેતો થયો જેથી જગ્યા ટૂંકી પડવા માંડી બેસવા માટે બાજુવાળા કુંભારભાઈઓનો સહકાર લેવો પડતો. હવે પરિવારને મંદિર મોટું બનાવવાની જરૂરીયાત જણાતા ઈ.સ. ૨૦૦૫માં એક મિટીંગનું આયોજન કરી મંદિર માટે ફાળો લેવાનું ચાલુ કરી ઈ.સ.૨૦૦૬માં બોદર પરિવાર સેવા ટ્રસ્ટની નોંધણી કરાવી અમરેલી સૌરાષ્ટ્ર ગ્રામીણ બેંકમાં ખાતુ ખોલાવી આવેલ ફાળાની રકમ બેંકમાં જમા કરવામાં આવી. મંદિરનું બાંધકામ ચાલુ કરતા પહેલા હયાત મૂર્તીનું સ્થળાંતર કરવા માટે વિક્રમ સવંત ૨૦૬૨ના આસો સુદ દશેરા તા.૦૨-૧૦-૨૦૦૬ને સોમવારના દિવસે હાજર રહેલ બોદર પરિવારના ભાઇઓ બહેનો અને સાધુસંતોની અને ગ્રામજનોની હાજરીમાં પૂર્ણ કરવામાં આવેલ હતું.',
            style: Styles.normal(fontSize: 20),
            textAlign: TextAlign.justify,
          ),
          const Gap(16),
          Text(
            'આ પ્રસંગે ભોજન પ્રસાદનો સહયોગ (૧) શ્રી નાનજીભાઈ કે. બોદર (૨) શ્રી બાબુભાઈ નનુભાઈ બોદર તથા હંસરાજભાઈ કે. બોદર તરફથી પ્રાપ્ત થયેલ હતો અને દશેરાની પૂજન વિધિના ખર્ચનો સહયોગ શ્રી નંદલાલભાઈ ગાંડુભાઈ બોદર મુ. જીવાપરવાળા તથા બોદર પરિવાર તરફથી પ્રાપ્ત થયો હતો.',
            style: Styles.normal(fontSize: 20),
            textAlign: TextAlign.justify,
          ),
          const Gap(16),
          Text(
            'મંદિર નિર્માણ માટે ભૂમી પૂજન અને ખાત મહુર્ત સવંત ૨૦૬૨ના આસો સુદ પૂર્ણીમા તા.૦૭-૧૦-૨૦૦૬ના રોજ શ્રી ભૂપતભાઈ જસમતભાઈ બોદર ગામ: બેડલા હાલ: રાજકોટ તથા શ્રી હંસરાજભાઈ કુરજીભાઈ બોદર ગામ: કેરીયાગાસ હાલ: અમરેલી તથા શ્રી લાલજીભાઈ ભોજાભાઈ બોદર ગામ: મોટા આંકડીયા હાલ: સુરત તથા પુજારી પરિવારના શ્રી કાળુબાપુના હસ્તે અમરેલીથી હાજર રહેલ શ્રી મનસુખભાઈ બોદર તથા સુરતથી હાજર રહેલ શ્રી નાનજીભાઈ બોદર તથા જીવાપરથી હાજર રહેલ શ્રી બાબુભાઈ બોદર તથા આ કામના એન્જિનીયર શ્રી ધીરૂભાઈ (મામા) હાલ અમેરીકા તથા ઉપસ્થિત બોદર પરિવાર તથા ગ્રામજનોની હાજરીમાં કરવામાં આવેલ હતું.',
            style: Styles.normal(fontSize: 20),
            textAlign: TextAlign.justify,
          ),
          const Gap(16),
          Text(
            'આ પ્રસંગ ભોજન પ્રસાદનો સહયોગ શ્રી બાબુભાઈ દુદાભાઈ બોદર જીવાપરવાળા તરફથી પ્રાપ્ત થયેલ હતો. બાદમાં મંદિરનું બાંધકામ શરૂ થયું જે માતાજી અને દાદાની કૃપાથી અવિરત પૂર્ણ થતા સુધી ચાલુ રહ્યું. તે દરમ્યાન આજુ બાજુના રહીશો તરફથીભૂમિદાન મળ્યું તથા કેટલીક જમીન મકાન ખરીદ કરીને વિશાળ જગ્યા પ્રાપ્ત થઈ. મંદિરનું બાંધકામ પૂર્ણ થતાં સવંત ૨૦૬૫ના ચૈત્ર સુદ તેરસ ચૌદસ અને પૂનમ તા. ૦૭,૦૮ અને ૦૯ એપ્રિલ ૨૦૦૯માં મંગળવાર, બુધવાર અને ગુરૂવાર એમ ત્રી દિવસીય કાર્યક્રમ સાથે ૨૭ કુંડી મહાયજ્ઞનું આયોજન કરવામાં આવ્યું હતું. આ યજ્ઞમાં મંદિરના દાતોઓ પૈકી ૮૨ યુગલોએ મહાયજ્ઞમાં સાતક બેસવાનો અમૂલ્ય લાભ લીધો હતો. આ ત્રી દિવસીય કાર્યક્રમમાં તમામ મહાપ્રસાદ તથા મોણપૂર ગામને ધુવાડાબંધ જમાડવાના ભોજનનો સહયોગ શ્રી ભૂપતભાઈ બોદર તરફથી પ્રાપ્ત થયેલ હતો તદુપરાંત મંદિરના બાંધકામ માટે રૂા. ૫,૫૧,૧૧૧/- નું દાન તેમના પિતાશ્રી સ્વ.જસમતભાઈ ગગજીભાઈ બોદર ના નામે શ્રી રામજીભાઈ તથા ભૂપતભાઈ તથા જગદિશભાઈ દ્વ્રારા આપવામાં આવેલ હતું. તદુપરાંત મંદિરના બાંધકામ માટે મોટુ દાન રૂા. ૧૧,૧૧,૧૧૧/- શ્રી બાબુભાઈ નનુભાઈ બોદર ગામ: મોટા આંકડીયાવાળા તરફથી તેના માતૃશ્રી શ્રીમતી વાલીબેન નનુભાઈ ગોવિંદભાઈના નામે શ્રી બાબુભાઈ તથા શ્રી ઘનશયામભાઈ તથા શ્રીકાંતિભાઈ દ્વ્રારા પ્રાપ્ત થયેલ છે. વધુમાં આ પ્રસંગે શ્રી સુરેશભાઈ વેલજીભાઈ બોદર ગામ: કેરીયાનાગસવાળા હાલ: સુરત તરફથી પોતાના ખર્ચે ગુજરાતના કલાકારો બોલાવીને આ ધાર્મિક પ્રસંગે સંતવાણી, ભજન અને ડાયરાનું આયોજન કરવામાં આવેલ હતું.',
            style: Styles.normal(fontSize: 20),
            textAlign: TextAlign.justify,
          ),
        ],
      ),
    );
  }
}
