import 'package:bodar_parivar_web/app/utils/styles.dart';
import 'package:flutter/material.dart';
import 'package:gap/gap.dart';
import 'package:get/get.dart';

import '../controllers/vadi_page_controller.dart';

class VadiPageView extends GetView<VadiPageController> {
  const VadiPageView({Key? key}) : super(key: key);
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('વાડી નિર્માણ'),
        backgroundColor: Theme.of(context).colorScheme.inversePrimary,
      ),
      body: ListView(
        padding: const EdgeInsets.symmetric(
          horizontal: 24,
          vertical: 16,
        ),
        children: [
          Text(
            'વાડી નિર્માણ',
            style: Styles.bold(fontSize: 20),
            textAlign: TextAlign.center,
          ),
          Divider(
            indent: Get.width * .2,
            endIndent: Get.width * .2,
          ),
          const Gap(16),
          Text(
            'મંદિરનું કાર્ય પૂર્ણ થયાને બે વરસ જેટલો સમય પસાર થયો દરમ્યાન મંદિરની આજુ બાજુ વસતા કેટલાક પરિવારોએ પ્લોટમાં મકાનો બનાવતા આ ખાલી પડેલ મકાનો/ જમીન બોદર પરિવાર ટ્રસ્ટને દાનમાં મળતા તેમજ કેટલાક મકાનો જે વાડી માટે જરૂરી હતા તે વેચાતા રાખતા પરિવાર પાસે વાડી માટે પૂરતા પ્રમાણમાં જમીન ઉપલબ્ધ થતાં વાડીના નિર્માણ માટે ફાળો/ દાન એકત્ર કરવા માટે નાના મોટા તમામ ગામોમાં મીટીંગો યોજી. ફાળો એકત્ર કરવાનું ચાલુ રાખી રાજકોટ ખાતે શ્રી ભૂપતભાઈ દ્વારા ઈજનેરો બોલાવીને જમીનનો સર્વે કરાવી વાડીનો પ્લાન બનાવી તે મુજબ કામ સવંત ૨૦૧૨ થી ૨૦૧૪ દરમ્યાન કરાવવામાં આવેલ છે. આ વાડીના બાંધકામ માટે ૨૦૧૧ થી જાહેરાત કરી ફાળાની શરૂઆત કરવામાં આવેલ હતી. તા.૦૬-૦૪-૨૦૧૧ હનુમાન જન્મોત્સવના દિવસે જાહેર કરી પત્રીકા દરેક ગામે મોકલી આપીને જણાવવામાં આવેલ હતુ કે, જે કોઈ વાડીના કામ માટે રૂા.૧૧૦૦૦૦૦/- અંકે રૂપિયા અગિયાર લાખનું દાન આપશે તેનું વાડીમાં મુખ્ય દાતા તરીકે નામ આપવામાં આવશે આ બાબતે મુખ્ય દાતાશ્રી નાનજીભાઈ કાનજીભાઈ બોદર તરફથી રૂા.૧૧૧૧૧૧૧/- નું દાન તેના પૂજ્ય માતુશ્રી સ્વ.દુધીબેન કાનજીભાઈ બોદરના નામના નામે પ્રાપ્ત થતાં વાડીનું નામાભિધાન "દુધીબાવાડી" સૌજન્ય શ્રીમતિ લલીતાબેન નાનજીભાઈ બોદર તરીકે કરવામાં આવેલ છે. વધુમાં વાડીમાં રસોઈ ઘરના દાતાશ્રી ભૂપતભાઈ જસમતભાઈ બોદર તરફથી રૂા. ૫૫૧૧૧૧/- તેમના માતુશ્રી શ્રીમતિ દુધીબેન જસમતભાઈ બોદરના નામે શ્રીમતિ શોભનાબેન ભૂપતભાઈ બોદર તથા જેમીનભાઈ બોદર તથા શિવમભાઈ બોદરના હસ્તે પ્રાપ્ત થયેલ છે. વાડીના તથા મંદિરના કામે જેમના તરફ થી રૂા. એક લાખ કે તેથી વધુ રકમનું દાન મળેલ છે. તેમના નામની તકતીઓ વાડીના અંદરના ભાગે બે પીલોર વચ્ચે લગાવેલ છે. જેમણે મંદિર માટે રૂા. ૫૦૦૦ કે તેથી વધુ રકમનું દાન તથા વાડી માટે રૂા. ૧૧૦૦૦/- કે તેથી વધુ રકમનું દાન આપેલ છે. તેના નામની સંયુકત તકતી વાડીના મુખ્ય દરવાજાની બાજુમાં લગાવવામાં આવેલ છે. ',
            style: Styles.normal(fontSize: 20),
            textAlign: TextAlign.justify,
          ),
          const Gap(16),
          Text(
            'ટ્રસ્ટને જે દાતાઓ તરફથી ભૂમીદાન મળેલ છે તેના નામની તકતી વાડીમાં લગાવવામાંઆવેલ છે. વાડીનું બાંધકામ માતાજી અને દાદાની કૃપાથી નિર્વિઘ્ને પૂર્ણ થતાં તા.૦૪-૦૪-૨૦૧૫ના રોજ ૫૧ કુંડી મહાયજ્ઞનું આયોજન કરવામાં આવેલ હતું. તેની પાછળનો હેતુ વાડીના ફાળામાં રૂા. ૧૧૦૦૦/- કે તેથી વધુનું દાન આપેલ હતું. તેવા તમામ પરિવારોને યજ્ઞમાં સાતક બેસવાનો લાહવો વિનામૂલ્યે આપવાનો હતો. આ મહાયજ્ઞમાં કુલ ૧૫૩ પરિવારોએ ભાગ લઈ ધન્યતાનો અનુભવ કરેલો હતો.',
            style: Styles.normal(fontSize: 20),
            textAlign: TextAlign.justify,
          ),
          const Gap(16),
        ],
      ),
    );
  }
}
